Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: The SockJS bridge provided by Vert.x allows browser applications and Quarkus applications to communicate using the event bus. It connects both sides. So, both sides can send messages received on the other side. It supports the three delivery mechanisms.
zh_cn: Vert.x提供的SockJS桥允许浏览器应用程序和Quarkus应用程序使用事件总线进行通信。它连接了双方。所以，双方都可以发送在另一方收到的消息。它支持三种传递机制。

source: The UBI minimal image is bigger than the micro one mentioned above. It contains more utilities such as the `microdnf` package manager.
zh_cn: UBI最小镜像比上面提到的微镜像要大。它包含更多的实用程序，如 `microdnf` 软件包管理器。

source: The URL can now be updated during the deployment or at launch time using system properties or environment variables.
zh_cn: 现在可以在部署期间或在启动时使用系统属性或环境变量更新URL。

source: The YAML configuration also support profile aware files. In this case, properties for a specific profile may reside in an `application-{profile}.yaml` named file. The previous example may be expressed as:
zh_cn: YAML 配置还支持环境配置文件的感知。在这种情况下，特定环境下的配置文件的属性可以书写在一个名为 `application-{profile}.yaml` 的文件中。前面的例子也可以表示为:

source: The YAML format also supports xref:config-reference.adoc#expressions[expressions], using the same format as Java Properties:
zh_cn: YAML格式同时也支持 link:config-reference.html#expressions[表达式] ，使用与Java Properties相同的格式:

source: The _liveness_ check captures any unrecoverable failure happening during the communication with Kafka.
zh_cn: _活跃性_ 检查可以捕获与Kafka通信过程中发生的任何不可恢复的故障。

source: The _readiness_ check verifies that the Kafka connector is ready to consume/produce messages to the configured Kafka topics.
zh_cn: _就绪_ 检查确保Kafka 连接器是否准备好针对配置的Kafka topic消费或生产消息。

source: The _return_ value of a method annotated with `@ConsumeEvent` is used to respond to the incoming message. For instance, in the following snippet, the returned `String` is the response.
zh_cn: 用 `@ConsumeEvent` 注解的方法的 _返回值_ 被用来响应传入的消息。例如，在下面的代码片段中，返回的 是 `String` 类型。

source: The _startup_ check verifies that the communication with Kafka cluster is established.
zh_cn: _启动_ 检查确保与Kafka集群的通信是否建立。

source: The `%prod` prefix indicates that the property is only used when the application runs in prod mode (so not in dev or test). Refer to the xref:config-reference.adoc#profiles[Profile documentation] for further details.
zh_cn: `%prod` 前缀表示该属性只在应用程序运行在生产模式下时生效(而不是在开发或测试模式)。更多细节请参考 xref:config-reference.adoc#profiles[Profile documentation]。

source: The `-Dquarkus.native.container-build=true` instructs Quarkus to build Linux 64bits native executables, who can run inside containers. Then, run the system using:
zh_cn: `-Dquarkus.native.container-build=true` 指示Quarkus构建可以在容器中运行的64位Linux本地可执行文件。然后，使用以下命令运行系统：

source: The `.onItem().transform(...)` can be replaced with `.map(...)`. `map` is a shortcut.
zh_cn: `.onItem().transform(...)` 可以用 `.map(...)` 取代。`map` 是它的快捷方式。

source: The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) and only users granted with the `admin` role can access it.
zh_cn: `/api/admin` 节点受到RBAC（基于角色的访问控制）的保护，只有被授予 `admin` 角色的用户才能访问它。

source: The `/api/admin` endpoint is protected with RBAC (Role-Based Access Control) where only users granted with the `admin` role can access. At this endpoint, we use the `@RolesAllowed` annotation to declaratively enforce the access constraint.
zh_cn: 端点 `/api/admin` 受到RBAC（基于角色的访问控制）的保护，只有被授予 `admin` 角色的用户可以访问。在这个端点，我们使用 `@RolesAllowed` 注解来声明性地执行访问限制。

source: The `/api/users/me` endpoint can be accessed by any user with a valid token. As a response, it returns a JSON document with details about the user where these details are obtained from the information carried on the token. This endpoint is protected with RBAC (Role-Based Access Control) and only users granted with the `user` role can access this endpoint.
zh_cn: `/api/users/me` 节点可由任何拥有有效token的用户访问。作为响应，它返回一个JSON文档，其中包含关于用户的详细信息，这些详细信息是从token上的信息中获得的。这个节点受到RBAC（基于角色的访问控制）的保护，只有被授予 `user` 角色的用户才能访问这个节点。

source: The `/api/users/me` endpoint can be accessed by any user with a valid token. As a response, it returns a JSON document with details about the user where these details are obtained from the information carried on the token.
zh_cn: 端点 `/api/users/me` 可由任何拥有有效令牌的用户访问。作为响应，它返回一个JSON文档，其中包含关于用户的细节，这些细节是从令牌上携带的信息获得的。

source: The `/subject/denied` endpoint disallows any access regardless of whether the call is authenticated by specifying the `@DenyAll` annotation.
zh_cn: `/subject/denied` 节点使用了 `@DenyAll` 注解，所以不允许任何访问，即使访问是认证过的。

source: The `/subject/unsecured` endpoint allows for unauthenticated access by specifying the `@PermitAll` annotation.
zh_cn: `/subject/unsecured` 节点通过使用 `@PermitAll` 注解来允许未认证的访问。

source: The `@BsonId` annotation is used instead of `@BsonProperty("_id")` for brevity's sake, but use of either is valid.
zh_cn: 为了简洁起见，使用了 `@BsonId` 注解，而不是 `@BsonProperty("_id")` ，但使用其中任何一种都是有效的。

source: The `@ConsumeEvent` annotation can be configured to set the address:
zh_cn: 可以配置 `@ConsumeEvent` 注解设置地址：

source: The `@MongoEntity` annotation allows configuring:
zh_cn: `@MongoEntity` 注解允许根据以下配置：

source: The `@NonBlocking` annotation is only required with SmallRye Fault Tolerance 5.1.0 and earlier. Starting with SmallRye Fault Tolerance 5.2.0 (available since Quarkus 2.1.0.Final), it is not necessary. See https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/usage/extra.html#_non_compatible_mode[SmallRye Fault Tolerance documentation] for more information.
zh_cn: `@NonBlocking` 注解仅在SmallRye Fault Tolerance 5.1.0及之前版本中需要。从SmallRye Fault Tolerance 5.2.0开始(Quarkus 2.1.0.Final开始)，它就不再必须了。更多信息请参见link:https://smallrye.io/docs/smallrye-fault-tolerance/5.2.0/usage/extra.html#_non_compatible_mode[SmallRye 容错文档] 。

source: The `@ReactiveTransactional` annotation will also work for testing. This means that changes done during the test will be propagated to the database. If you want any changes made to be rolled back at the end of the test you can use the `io.quarkus.test.TestReactiveTransaction` annotation. This will run the test method in a transaction, but roll it back once the test method is complete to revert any database changes.
zh_cn: `@ReactiveTransactional` 注解也可用于测试。这意味着在测试期间所做数据变更将被持久化到数据库中。如果你想在测试结束时回滚所有数据库变更，可以使用 `io.quarkus.test.TestReactiveTransaction` 注解。加入这个注解后将在一个事务中运行测试方法，当测试方法完成，就会回滚事务，以恢复所有数据库的变更。

source: The `@RegisterForReflection` annotation instructs Quarkus to include the class (including fields and methods) when building the native executable. This will be useful later when we run the applications as native executables inside containers. Without, the native compilation would remove the fields and methods during the dead-code elimination phase.
zh_cn: `@RegisterForReflection` 注释指示Quarkus在构建本地可执行文件时包含类（包括字段和方法）。这在以后我们在容器中作为本地可执行文件运行应用程序时将会很有用。如果没有这个注释，本地编译会在死代码清除阶段删除这些字段和方法。

source: The `@RegisterForReflection` annotation instructs Quarkus to keep the class and its members during the native compilation. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
zh_cn: `@RegisterForReflection` 注解指示Quarkus在本地编译过程中保留该类和其成员。关于 `@RegisterForReflection` 注解的更多细节，请访问 link:writing-native-applications-tips.html#registerForReflection[本地应用程序提示] 。

source: The `@RegisterRestClient` registers the implementation of the rest-client at runtime, and because the bean needs to be a regular scope, you have to annotate your interface with `@ApplicationScoped`.
zh_cn: `@RegisterRestClient` 在运行时注册了rest-client的实现，并且由于bean需要保证使用了一个正常的scope，您必须使用 `@ApplicationScoped` 来注释您的接口。

source: The `@TransactionConfiguration` annotation allows to set a timeout property, in seconds, that applies to transactions created within the annotated method.
zh_cn: `@TransactionConfiguration` 注解允许设置一个超时属性，以秒为单位，适用于在注解方法中创建的事务。

source: The `Emitter` configuration is done the same way as the other stream configuration used by `@Incoming` and `@Outgoing`.
zh_cn: `Emitter` 的配置方式与 其他被 `@Incoming` 和 `@Outgoing` 使用的流配置相同。

source: The `EventBus` object provides methods to:
zh_cn: `EventBus` 对象提供了以下方法：

source: The `Fruit` objects will be automatically serialized/deserialized by https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] or https://github.com/FasterXML/jackson[Jackson], depending on the extension you chose when initializing the project.
zh_cn: `Fruit` 对象将被 link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] 或 link:https://github.com/FasterXML/jackson[Jackson] 自动序列化/反序列化，这取决于你在初始化项目时选择的扩展。

source: The `GreetingService` bean will be injected into the test
zh_cn: `GreetingService` bean将被注入到测试类中

source: The `HttpAuthenticationMechanism` interface is the main entry mechanism for securing HTTP applications in Quarkus.
zh_cn: `HttpAuthenticationMechanism` 接口是Quarkus 保护HTTP 程序安全的主要入口机制。

source: The `JsonWebToken` interface defines methods for accessing claims in the underlying JWT. It provides accessors for common claims that are required by the {mp-jwt} specification as well as arbitrary claims that may exist in the JWT.
zh_cn: 这个 `JsonWebToken` 接口定义了用于访问底层JWT中的声明(claims)的方法。它为{mp-jwt}规范所要求的共同声明(common claims)以及JWT中可能存在的任何的声明提供访问器。

source: The `KafkaClientService` is an experimental API and can change in the future.
zh_cn: `KafkaClientService` 是一个实验性的API，在未来可能会发生变化。

source: The `KafkaTransactions#withTransactionAndAck` method acks and nacks the message but will *not* return a failing `Uni`. Nacked messages will be handled by the failure strategy of the incoming channel, (see <<error-handling>>). Configuring `failure-strategy=ignore` simply resets the Kafka consumer to the last committed offsets and resumes the consumption from there.
zh_cn: `KafkaTransactions#withTransactionAndAck` 方法确认和确认消息，但 *不会* 返回失败的 `Uni` 。 Nacked 消息将由传入通道的故障策略处理，（参见<<error-handling>>）。 配置 `failure-strategy=ignore` 只是将 Kafka 消费者重置为最后提交的偏移量并从那里恢复消费。

source: The `KafkaTransactions` custom emitter provides a way to apply exactly-once processing to an incoming Kafka message inside a transaction.
zh_cn: `KafkaTransactions` 定制emitter可以提供一种对事务中传入的 Kafka 消息进行一次性处理的方法。

source: The `KubernetesServerTestResource` class has to implement the `QuarkusTestResourceConfigurableLifecycleManager` interface in order to be configured using the previous annotation:
zh_cn: `KubernetesServerTestResource` 类必须实现 `QuarkusTestResourceConfigurableLifecycleManager` 接口，以便使用前面的注解进行配置：

source: The `Message` type lets the consuming method access the incoming message metadata and handle the acknowledgment manually. We'll explore different acknowledgment strategies in <<commit-strategies>>.
zh_cn: `Message` 类型允许consuming methond访问接收到消息的metadata并手动进行确认。我们将在 <<commit-strategies>>中探讨不同的确认策略。

source: The `PanacheQuery` type has many other methods to deal with paging and returning streams.
zh_cn: `PanacheQuery` 类型有许多其他方法来处理分页和返回流。

source: The `Price` instances are automatically encoded to JSON by the connector
zh_cn: `Price` 实例被连接器自动编码为JSON。

source: The `Quote` class will be used in both `producer` and `processor` projects. For the sake of simplicity we will duplicate the class. In both projects, create the `src/main/java/org/acme/amqp/model/Quote.java` file, with the following content:
zh_cn: `Quote` 类将用在 `producer` 和 `processor` 项目中。为了简单起见，我们将重复这个类。在两个项目中，创建 `src/main/java/org/acme/amqp/model/Quote.java` 文件，其内容如下：

source: The `RedisClient` and `ReactiveRedisClient` provide factory methods to create clients programmatically. The client to be created are configured using the usual <<config-reference,Redis configuration>>.
zh_cn: `RedisClient` 和 `ReactiveRedisClient` 提供工厂方法，以便用编程方式创建客户端。这样可以创建出使用常规 link:#config-reference[Redis配置] 的客户端。

source: The `RedisHostsProvider` programmatically provides redis hosts. This allows for configuration of properties like redis connection password coming from other sources.
zh_cn: `RedisHostsProvider` 接口支持以编程方式设定Redis主机。这个机制支持了从其他来源获取Redis连接属性进行配置，如Redis连接密码等。

source: The `Sort` class has plenty of methods for adding columns and specifying sort direction.
zh_cn: `Sort` 类有很多方法用于添加列和指定排序方向。

source: The `Uni` returned from the `KafkaTransactions#withTransaction` will yield a failure if the transaction fails and is aborted. The application can choose to handle the error case, but if a failing `Uni` is returned from the `@Incoming` method, the incoming channel will effectively fail and stop the reactive stream.
zh_cn: 如果事务失败并被中止，则从 KafkaTransactions#withTransaction 返回的 `Uni` 将产生失败。 应用程序可以选择处理错误情况，但如果从 `@Incoming` 方法返回失败的 `Uni` ，则传入通道将有效地失败并停止响应流。

source: The `Value` attribute is the root URL for your lambda. Copy it to your browser and add `hello` at the end.
zh_cn: `Value` 属性是你的lambda的根URL。把它复制到你的浏览器，并在末尾添加 `hello` 。

source: The `application.yaml` file may also be placed in `config/application.yaml` to specialize the runtime configuration. The file has to be present in the root of the working directoryrelative to the Quarkus application runner:
zh_cn: `application.yaml` 文件也可以放在 `config/application.yaml` 中，以专门实现运行时的配置。该文件必须存在于相对Quarkus应用运行程序的工作目录的根目录中:

source: The `b3`, `b3multi`, `jaeger` and `ottrace` propagators will need the https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/trace-propagators[trace-propagators] extension to be added as a dependency to your project.
zh_cn: `b3` , `b3multi` , `jaeger` 和 `ottrace` propatagors 需要将 link:https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/trace-propagators[trace-propagators] 扩展作为一个依赖添加到您的项目中。

source: The `birthday` claim. It can be considered to be a sensitive claim, so you may want to consider encrypting the claims, see xref:security-jwt-build.adoc[Generate JWT tokens with SmallRye JWT].
zh_cn: 这个 `birthday` 声明(claim)，它可以被认为是一个敏感的声明，所以你可能要考虑对这些声明进行加密， link:smallrye-jwt-build.html[见用SmallRye JWT生成JWT令牌] 。

source: The `channel-name` segment must match the value set in the `@Incoming` and `@Outgoing` annotation:
zh_cn: `channel-name` 片段必须与 `@Incoming` 和 `@Outgoing` 注解中设定的值相匹配:

source: The `create` method allows adding a new fruit to the database:
zh_cn: `create` 方法允许向数据库中添加新水果记录：

source: The `default-kafka-broker` configuration map contains all application properties prefixed with `kafka.` or `KAFKA_`. For more configuration options check out <<kafka-configuration-resolution>>.
zh_cn: `default-kafka-broker` 配置map包含所有以 `kafka.` 或 `KAFKA_` 为前缀的应用属性。更多的配置选项，请查看 link:#kafka-configuration-resolution[[kafka配置方案]] 。

source: The `get()` method allows retrieving the current value.
zh_cn: `get()` 方法允许检索当前值。

source: The `group` claim provides the groups and top-level roles associated with the JWT bearer.
zh_cn: 这个 `group` 声明(claim)提供了与JWT bearer相关的group和最高级别的role。

source: The `http://localhost:8080/api/admin` endpoint can only be accessed by users with the `admin` role. If you try to access this endpoint with the previously issued access token, you should get a `403` response from the server.
zh_cn: 该 `http://localhost:8080/api/admin` 端点只能由具有 `admin` 角色的用户访问。如果你试图用先前发布的访问令牌访问这个端点，你应该会从服务器上得到一个 `403` 的响应。

source: The `init` method receives an `Instance<MyVerticle>`. Then, you pass a supplier to the `deployVerticle` method. The supplier is just calling the `get()` method. Thanks to the `@Dependent` scope, it returns a new instance on every call. Finally, you pass the desired number of instances to the `DeploymentOptions`, such as two in the previous example. It will call the supplier twice, which will create two instances of your verticle.
zh_cn: `init` 方法接收一个 `Instance<MyVerticle>` 。然后，你将提供者传递给 `deployVerticle` 方法。该提供者只是在调用 `get()` 方法。由于 `@Dependent` 范围，它每次调用都会返回一个新的实例。最后，你向 `DeploymentOptions` 传递所需的实例数量，比如在前面的例子中是两个。它将调用提供者两次，这将为你的verticle创建两个实例。

source: The `io.quarkus.mongodb.ReactiveMongoClient` client is deprecated and will be removed in the future. It is recommended to switch to the `io.quarkus.mongodb.reactive.ReactiveMongoClient` client providing the `Mutiny` API.
zh_cn: `io.quarkus.mongodb.ReactiveMongoClient` 客户端已被废弃，并将在未来被删除。建议切换到提供 `Mutiny` API的 `io.quarkus.mongodb.reactive.ReactiveMongoClient` 客户端。

source: The `io.quarkus.test.junit.QuarkusMock` class can be used to temporarily mock out any normal scoped bean. If you use this method in a `@BeforeAll` method the mock will take effect for all tests on the current class, while if you use this in a test method the mock will only take effect for the duration of the current test.
zh_cn: `io.quarkus.test.junit.QuarkusMock` 类可以被用来临时mock任何正常scope的bean。如果您在 `@BeforeAll` 方法中使用这个方法，mock将对当前类的所有测试生效，而如果您在测试方法中使用这个方法，mock将只在当前测试方法范围内生效。

source: The `io.smallrye.reactive.messaging.annotations.Emitter`, `io.smallrye.reactive.messaging.annotations.Channel` and `io.smallrye.reactive.messaging.annotations.OnOverflow` classes are now deprecated and replaced by:
zh_cn: `io.smallrye.reactive.messaging.annotations.Emitter` , `io.smallrye.reactive.messaging.annotations.Channel` 和 `io.smallrye.reactive.messaging.annotations.OnOverflow` 类现在已被废弃，并被替换为：

source: The `iss` claim is the issuer of the JWT. This needs to match the server side `mp.jwt.verify.issuer`. in order for the token to be accepted as valid.
zh_cn: 这个 `iss` 声明(claim)是JWT的发行者。这需要与服务器端的 `mp.jwt.verify.issuer` 符合。一遍使令牌被接受为有效的。

source: The `kotlin-maven-plugin` is configured as follows:
zh_cn: `kotlin-maven-plugin` ，其配置如下。

source: The `kotlin-stdlib-jdk8` is also added as a dependency.
zh_cn: `kotlin-stdlib-jdk8` 也作为依赖被添加进来。

source: The `mapTo` method uses the Quarkus Jackson mapper. Check xref:rest-json.adoc#json[this guide] to learn more about the mapper configuration.
zh_cn: `mapTo` 方法使用Quarkus Jackson 映射器。请查看 link:rest-json.html#json[本指南] 以了解更多关于映射器的配置。

source: The `mockableBean1` is configured here for every test method of the class
zh_cn: `mockableBean1` 被mockito配置并可以为类的每个测试方法所用

source: The `mp.jwt.verify.publickey` config property allows the Public Key text itself to be supplied as a string. The Public Key will be parsed from the supplied string in the order defined in section <<Supported Public Key Formats>>.
zh_cn: 这个 `mp.jwt.verify.publickey` 配置属性允许将公钥文本本身作为一个字符串提供。公钥将按照 <<支持的公钥格式>> 一节中所定义的顺序，从提供的字符串中解析出来。

source: The `ownerName` DTO constructor's parameter will be loaded from the `owner.name` HQL property.
zh_cn: DTO构造器的 `ownerName` 参数将从 `owner.name` HQL属性加载。

source: The `pom.xml` file contains:
zh_cn: `pom.xml` 文件包括：

source: The `process` method is called for every AMQP message from the `quote-requests` queue, and will send a `Quote` object to the `quotes` queue.
zh_cn: `process` 方法被 `quote-requests` 队列中的每一个AMQP消息调用，并将 `Quote` 对象发送给 `quotes` 队列。

source: The `quarkus-amazon-lambda` extension allows you to use Quarkus to build your AWS Lambdas. Your lambdas can use injection annotations from CDI or Spring and other Quarkus facilities as you need them.
zh_cn: `quarkus-amazon-lambda` 扩展允许你使用Quarkus来构建你的AWS Lambdas。你的Lambdas可以根据需要使用来自CDI或Spring的注入注解，以及其他Quarkus设施。

source: The `quarkus-amazon-lambda` extension scans your project for a class that directly implements the Amazon `RequestHandler<?, ?>` or `RequestStreamHandler` interface. It must find a class in your project that implements this interface or it will throw a build time failure. If it finds more than one handler class, a build time exception will also be thrown.
zh_cn: `quarkus-amazon-lambda` 扩展会为直接实现亚马逊 `RequestHandler<?, ?>` 或 `RequestStreamHandler` 接口的类扫描你的项目。它必须在你的项目中找到一个实现该接口的类，否则它将抛出一个构建时间失败。如果它发现一个以上的处理程序类，也会抛出一个构建时间异常。

source: The `quarkus-keycloak-authorization` extension is based on `quarkus-oidc` and provides a policy enforcer that enforces access to protected resources based on permissions managed by Keycloak and currently can only be used with the Quarkus xref:security-openid-connect.adoc[OIDC service applications]. It provides a flexible and dynamic authorization capability based on Resource-Based Access Control. In other words, instead of explicitly enforcing access based on some specific access control mechanism (e.g.: RBAC), you just check whether a request is allowed to access a resource based on its name, identifier or URI.
zh_cn: `quarkus-keycloak-authorization` 扩展基于 `quarkus-oidc` ，并提供了一个策略实施者(policy enforcer)来根据Keycloak管理的权限去实施对受保护资源的访问。它目前只能与Quarkus link:security-openid-connect.html[OIDC服务应用] 一起使用。它提供了一个基于资源访问控制的灵活和动态的授权能力。换句话说，您不需要明确地根据一些特定的访问控制机制（例如：RBAC）来执行访问，而只需要根据资源的名称、标识或URI来检查一个请求是否被允许访问。

source: The `quarkus-kotlin` artifact is added to the dependencies. This artifact provides support for Kotlin in the live reload mode (more about this later on)
zh_cn: `quarkus-kotlin` 会被添加到依赖项中。这个依赖提供了对实时重载模式下的Kotlin的支持（后面会有更多关于这个的介绍）

source: The `quarkus-oidc-client-filter` extension requires the `quarkus-oidc-client` extension and provides JAX-RS `OidcClientRequestFilter`, which sets the access token acquired by `OidcClient` as the `Bearer` scheme value of the HTTP `Authorization` header. This filter can be registered with MP RestClient implementations injected into the current Quarkus endpoint, but it is not related to the authentication requirements of this service endpoint. For example, it can be a public endpoint, or it can be protected with mTLS.
zh_cn: `quarkus-oidc-client-filter` 扩展依赖于 `quarkus-oidc-client` 扩展，并提供 JAX-RS `OidcClientRequestFilter` ，它将由 `OidcClient` 获得的访问token设置为 HTTP `Authorization` 头的 `Bearer` scheme值。这个过滤器可以与注入当前 Quarkus 节点的 MP RestClient 实现一起被注册，但它与这个服务节点的认证要求无关。例如，它可以是一个公共节点，也可以用mTLS保护。

source: The `quarkus-oidc-client` extension provides `OidcClient` for acquiring and refreshing access tokens from OpenID Connect and OAuth2 providers that support the following token grants:
zh_cn: `quarkus-oidc-client` 扩展提供 `OidcClient` ，用于从支持以下token授权的OpenID Connect和OAuth2提供者那里获取和刷新访问token：

source: The `quarkus-oidc-token-propagation` extension requires the `quarkus-oidc` extension and provides JAX-RS `TokenCredentialRequestFilter`, which sets the OpenID Connect Bearer or Authorization Code Flow access token as the `Bearer` scheme value of the HTTP `Authorization` header. This filter can be registered with MP RestClient implementations injected into the current Quarkus endpoint, which in turn must be protected by using the Quarkus OpenID Connect adapter. This filter can be used to propagate the access token to the downstream services.
zh_cn: `quarkus-oidc-token-propagation` 扩展依赖于 `quarkus-oidc` 扩展，并提供 JAX-RS `TokenCredentialRequestFilter` ，它将 OpenID Connect Bearer 或 Authorization Code Flow 访问token设置为 HTTP `Authorization` 头的 `Bearer` scheme值。这个过滤器可以与注入当前 Quarkus 节点的 MP RestClient 实现一起被注册，并且Quarkus节点本身必须用Quarkus OpenID Connect适配器来保护。这个过滤器可以用来将访问token传播到下游服务中。

source: The `quarkus-smallrye-jwt` extension provides a MicroProfile JSON Web Token (JWT) 1.2.1 implementation and multiple options to verify signed and encrypted `JWT` tokens and represents them as `org.eclipse.microprofile.jwt.JsonWebToken`.
zh_cn: `quarkus-smallrye-jwt` 提供Microprofile JWT 1.2.1的实现和更多的选项来验证签名和加密的 `JWT` token，并将其表示为 `org.eclipse.microprofile.jwt.JsonWebToken`。

source: The `quarkus.http.root-path` configuration property is used to change the xref:http-reference.adoc#context-path[http endpoint context path].
zh_cn: `quarkus.http.root-path` 配置项被用于改变 link:http-reference.html#context-path[http节点上下文路径] 。

source: The `quarkus.lambda.handler` property tells Quarkus which lambda handler to deploy. This can be overridden with an environment variable too.
zh_cn: `quarkus.lambda.handler` 属性告诉Quarkus要部署哪个lambda处理程序。这也可以用一个环境变量来覆盖。

source: The `quarkus.mongodb.database` property will be used by MongoDB with Panache to determine the name of the database where your entities will be persisted (if not overridden by `@MongoEntity`).
zh_cn: MongoDB将使用 `quarkus.mongodb.database` 属性和Panache来确定实体将持久化的数据库的名称。（如果没有被 `@MongoEntity` 重写）。
